In [1]:
import pyodbc
from dotenv import dotenv_values
import pandas as pd
import numpy as np
from scipy import stats
import statistics as stat
import warnings
import os
 
warnings.filterwarnings('ignore')

In [2]:
# Load environment variables from .env file into a dictionary
environment_variables = dotenv_values('.env')
 
 
# Get the values for the credentials you set in the '.env' file
server = environment_variables.get("SERVER")
database = environment_variables.get("DATABASE")
username = environment_variables.get("USERNAME")
password = environment_variables.get("PASSWORD")

In [3]:
conn_str =f"DRIVER={{SQL Server}};SERVER={server};DATABASE={database};UID={username};PWD={password}"

In [4]:
connection = pyodbc.connect(conn_str)

In [5]:
query1 = "Select * from LP1_startup_funding2020"
data_2020 = pd.read_sql(query1, connection)
 
query2 = "Select * from LP1_startup_funding2021"
data_2021 = pd.read_sql(query2, connection)

In [74]:
data_2018_new['Year']='2018'
data_2019['Year']='2019'
data_2020['Year']='2020'
data_2021['Year']='2021'

In [75]:
data_2019.drop(['Founded', 'Founders', 'Investor'], axis=1, inplace=True)
data_2020.drop(['Founded', 'Founders', 'Investor','column10'], axis=1, inplace=True)
data_2021.drop(['Founded', 'Founders', 'Investor'], axis=1, inplace=True)

In [78]:
data_2018 = data_2018_new.rename(columns={'Company Name': 'Company_Brand', 'Round/Series': 'Stage', 'Industry': 'Sector', 'Amount': 'Amount', 'About Company': 'BIO', 'Location':'HeadQuarter'})
data_2019 = data_2019.rename(columns={'Company/Brand': 'Company_Brand', 'Sector': 'Sector', 'Stage': 'Stage', 'Amount($)': 'Amount', 'What it does': 'BIO', 'HeadQuarter':'HeadQuarter'})
data_2020 = data_2020.rename(columns={'Company_Brand':'Company_Brand','What_it_does':'Bio'})
data_2021 = data_2021.rename(columns={'Company_Brand':'Company_Brand','What_it_does':'Bio'})

In [77]:
data_2020.head(2)

,Company_Brand,HeadQuarter,Sector,Bio,Amount,Stage,Year
0,Aqgromalin,Chennai,AgriTech,Cultivating Ideas for Profit,200000.0,None,2020
1,Krayonnz,Bangalore,EdTech,An academy-guardian-scholar centric ecosystem ...,100000.0,Pre-seed,2020

In [79]:
data_2020.shape

(1055, 7)

In [80]:
data_2020.isna().sum()

Company_Brand      0
HeadQuarter        0
Sector            13
Bio                0
Amount           254
Stage            464
Year               0
dtype: int64

In [81]:
data_2020['HeadQuarter'].fillna(method='ffill', inplace=True)

In [82]:
data_2020.isna().sum()

Company_Brand      0
HeadQuarter        0
Sector            13
Bio                0
Amount           254
Stage            464
Year               0
dtype: int64

In [83]:
data_2021.head(2)

,Company_Brand,HeadQuarter,Sector,Bio,Amount,Stage,Year
0,Unbox Robotics,Bangalore,AI startup,Unbox Robotics builds on-demand AI-driven ware...,"$1,200,000",Pre-series A,2021
1,upGrad,Mumbai,EdTech,UpGrad is an online higher education platform.,"$120,000,000",None,2021

In [84]:
data_2021.isna().sum()

Company_Brand      0
HeadQuarter        1
Sector             0
Bio                0
Amount             3
Stage            428
Year               0
dtype: int64

In [12]:
data_2021.shape

(1209, 9)

In [85]:
data_2021['HeadQuarter'].fillna(method='ffill', inplace=True)

In [87]:
data_2021.isna().sum()

Company_Brand      0
HeadQuarter        0
Sector             0
Bio                0
Amount             3
Stage            428
Year               0
dtype: int64

Hypothesis 
Hypothesis:  What the company dose depends on the amount of funding secured
Null Hypothesis: What the company dose not have infulence  on the amount of funding secured

  Hypothesis 
Hypothesis:  The amount of start up funding has infulence on the kind of investors 

Null Hypothesis: The amount of start up funding has no significance infulence on the investors

In [34]:
data_2019.isna().sum()

Company/Brand     0
Founded          29
HeadQuarter      19
Sector            5
What it does      0
Founders          3
Investor          0
Amount($)         0
Stage            46
dtype: int64

In [21]:
data_2019 = pd.read_csv('startup_funding2019.csv')

In [89]:
data_2019.isna().sum()

Company_Brand     0
HeadQuarter      19
Sector            5
BIO               0
Amount            0
Stage            46
Amount            0
Year              0
dtype: int64

In [65]:
data_2019.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89 entries, 0 to 88
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company/Brand  89 non-null     object
 1   Founded        60 non-null     float64
 2   HeadQuarter    70 non-null     object
 3   Sector         84 non-null     object
 4   What it does   89 non-null     object
 5   Founders       86 non-null     object
 6   Investor       89 non-null     object
 7   Amount($)      89 non-null     object
 8   Stage          43 non-null     object
dtypes: float64(1), object(8)
memory usage: 6.4+ KB

In [95]:
data_2019['HeadQuarter'].fillna(method='bfill', inplace=True)

In [96]:
data_2019.isna().sum()

Company_Brand     0
HeadQuarter       0
Sector            5
BIO               0
Amount            0
Stage            46
Amount            0
Year              0
dtype: int64

In [97]:
data_2019.head(2)

,Company_Brand,HeadQuarter,Sector,BIO,Amount,Stage,Amount,Year
0,Bombay Shaving,Mumbai,Ecommerce,Provides a range of male grooming products,"$6,300,000",NaN,"$6,300,000",2019
1,Ruangguru,Mumbai,Edtech,A learning platform that provides topic-based ...,"$150,000,000",Series C,"$150,000,000",2019

In [ ]:
data_2018 = pd.read_csv('startup_funding2018.csv')

In [98]:

data_2018.tail(5)

,Company_Brand,Sector,Stage,Amount,HeadQuarter1,BIO,HeadQuarter,Year
521,Udaan,"B2B, Business Development, Internet, Marketplace",Series C,225000000,"Bangalore, Karnataka, India","Udaan is a B2B trade platform, designed specif...",Bangalore,2018
522,Happyeasygo Group,"Tourism, Travel",Series A,—,"Haryana, Haryana, India",HappyEasyGo is an online travel domain.,Haryana,2018
523,Mombay,"Food and Beverage, Food Delivery, Internet",Seed,7500,"Mumbai, Maharashtra, India",Mombay is a unique opportunity for housewives ...,Mumbai,2018
524,Droni Tech,Information Technology,Seed,"₹35,000,000","Mumbai, Maharashtra, India",Droni Tech manufacture UAVs and develop softwa...,Mumbai,2018
525,Netmeds,"Biotechnology, Health Care, Pharmaceutical",Series C,35000000,"Chennai, Tamil Nadu, India",Welcome to India's most convenient pharmacy!,Chennai,2018

In [53]:
data_2018.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 526 entries, 0 to 525
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company Name   526 non-null    object
 1   Industry       526 non-null    object
 2   Round/Series   526 non-null    object
 3   Amount         526 non-null    object
 4   Location       526 non-null    object
 5   About Company  526 non-null    object
dtypes: object(6)
memory usage: 24.8+ KB

In [ ]:
data_2018_new=data_2018.rename(columns={'Location':'HeadQuarter1'})
data_2018_new

In [ ]:
data_2018=data_2018_new['HeadQuarter1'].str.split(pat=',', n=1, expand=True)
data_2018_new['HeadQuarter']=data_2018[0]

data_2018_new

In [63]:
data_2018_new.duplicated().value_counts()

False    525
True       1
dtype: int64

In [39]:
data_18= data_18.rename(columns={'Company Name':'Company_Brand','Sector':'Industry','Location':'Location','Amount':'Amount','Round/Series':'stage'})
data_19= data_19.rename(columns={'Company/Brand':'Company_Brand','Industry':'Industry','HeadQuarter':'Location','Amount($)':'Amount','stage':'stage'})
data_20= data_20.rename(columns={'Company_Brand':'Company_Brand','Sector':'Industry','HeadQuarter':'Location','Amount':'Amount','Stage':'stage'})
data_21= data_21.rename(columns={'Company_Brand':'Company_Brand','Sector':'Industry','HeadQuarter':'Location','Amount':'Amount','Stage':'stage'})

In [50]:
starup_df = pd.concat([data_18,data_19,data_20,data_21], axis=0)

In [51]:
starup_df.head(5)

,Company_Brand,Industry,stage,Amount,Location,Sector,Investor,Stage
0,TheCollegeFever,"Brand Marketing, Event Promotion, Marketing, S...",Seed,250000,"Bangalore, Karnataka, India",NaN,NaN,NaN
1,Happy Cow Dairy,"Agriculture, Farming",Seed,"₹40,000,000","Mumbai, Maharashtra, India",NaN,NaN,NaN
2,MyLoanCare,"Credit, Financial Services, Lending, Marketplace",Series A,"₹65,000,000","Gurgaon, Haryana, India",NaN,NaN,NaN
3,PayMe India,"Financial Services, FinTech",Angel,2000000,"Noida, Uttar Pradesh, India",NaN,NaN,NaN
4,Eunimart,"E-Commerce Platforms, Retail, SaaS",Seed,—,"Hyderabad, Andhra Pradesh, India",NaN,NaN,NaN

In [56]:
starup_df['Amount'].isna().sum()

257

In [55]:
starup_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2879 entries, 0 to 1208
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company_Brand  2879 non-null   object
 1   Industry       2777 non-null   object
 2   stage          1898 non-null   object
 3   Amount         2622 non-null   object
 4   Location       2765 non-null   object
 5   Sector         84 non-null     object
 6   Investor       2253 non-null   object
 7   Stage          43 non-null     object
dtypes: object(8)
memory usage: 202.4+ KB

In [61]:
amount = starup_df['Amount']

In [63]:
amount.L()

array(['250000', '₹40,000,000', '₹65,000,000', '2000000', '—', '1600000',
       '₹16,000,000', '₹50,000,000', '₹100,000,000', '150000', '1100000',
       '₹500,000', '6000000', '650000', '₹35,000,000', '₹64,000,000',
       '₹20,000,000', '1000000', '5000000', '4000000', '₹30,000,000',
       '2800000', '1700000', '1300000', '₹5,000,000', '₹12,500,000',
       '₹15,000,000', '500000', '₹104,000,000', '₹45,000,000', '13400000',
       '₹25,000,000', '₹26,400,000', '₹8,000,000', '₹60,000', '9000000',
       '100000', '20000', '120000', '₹34,000,000', '₹342,000,000',
       '$143,145', '₹600,000,000', '$742,000,000', '₹1,000,000,000',
       '₹2,000,000,000', '$3,980,000', '$10,000', '₹100,000',
       '₹250,000,000', '$1,000,000,000', '$7,000,000', '$35,000,000',
       '₹550,000,000', '$28,500,000', '$2,000,000', '₹240,000,000',
       '₹120,000,000', '$2,400,000', '$30,000,000', '₹2,500,000,000',
       '$23,000,000', '$150,000', '$11,000,000', '₹44,000,000',
       '$3,240,000', '₹60,000,000', '$540,000,000', '₹650,000,000',
       '₹1,600,000,000', '$900,000', '$10,000,000', '$1,500,000',
       '₹70,000,000', '$1,000,000', '$5,000,000', '$14,000,000',
       '₹102,500,000', '$100,000,000', '₹1,200,000', '₹5,200,000,000',
       '$800,000', '$1,041,000', '$100,000', '$15,000', '1400000',
       '1200000', '2200000', '1800000', '3600000', '₹9,500,000', '300000',
       '6830000', '200000', '₹150,000,000', '4300000', '364846', '400000',
       '1500000', '₹7,000,000', '₹1,400,000', '₹10,000,000',
       '₹22,500,000', '13200000', '50000', '₹140,200,000', '3000000',
       '1250000', '180000', '₹19,200,000', '₹103,000,000', '4200000',
       '175000', '1450000', '₹200,000', '4500000', '600000',
       '₹16,600,000', '₹12,000,000', '15000000', '₹33,000,000', '125000',
       '130000', '₹34,900,000', '₹72,000,000', '17200000', '₹32,000,000',
       '3500000', '₹135,000,000', '12000000', '$40,000,000', '$1,100,000',
       '$50,000,000', '₹1,540,000,000', '$3,000,000', '$6,000,000',
       '₹140,000,000', '$41,900,000', '₹1,410,000,000', '$3,530,000',
       '$200,000', '$3,300,000', '₹580,000,000', '₹36,000,000',
       '₹340,000,000', '$210,000,000', '$37,680,000', '$250,000',
       '$20,000', '₹510,000,000', '₹2,200,000,000', '22000000', '70000',
       '10000000', '₹15,392,000,000', '₹20,000,000,000', '₹4,000,000,000',
       '185000000', '65000000', '₹165,000,000', '700000', '30000000',
       '₹210,000,000', '210000000', '₹2,029,600,000', '75000000',
       '₹80,000,000', '1760000', '2700000', '₹280,000,000',
       '₹800,000,000', '750000', '2500000', '80000000', '25000000',
       '₹730,000,000', '₹400,000,000', '3700000', '5600000',
       '₹260,000,000', '99230000', '70000000', '40000', '550000',
       '50000000', '365000000', '₹8,750,000', '₹78,000,000', '28000000',
       '₹264,000,000', '100000000', '₹1,130,000,000', '₹810,000,000',
       '₹1,400,000,000', '14900000', '225000000', '7500', '35000000',
       '$6,300,000', '$150,000,000', '$28,000,000', 'Undisclosed',
       '$20,000,000', '$275,000,000', '$22,000,000', '$140,500',
       '$15,000,000', '$182,700', '$12,000,000', '$15,500,000',
       '$5,500,000', '$2,500,000', '$140,000', '$230,000,000',
       '$49,400,000', '$32,000,000', '$26,000,000', '$400,000',
       '$8,000,000', '$120,000,000', '$4,000,000', '$6,800,000',
       '$36,000,000', '$5,700,000', '$25,000,000', '$600,000',
       '$70,000,000', '$60,000,000', '$220,000', '$2,800,000',
       '$2,100,000', '$311,000,000', '$4,800,000', '$693,000,000',
       '$33,000,000', 200000.0, 100000.0, nan, 400000.0, 340000.0,
       600000.0, 45000000.0, 1000000.0, 2000000.0, 1200000.0, 660000000.0,
       120000.0, 7500000.0, 5000000.0, 500000.0, 3000000.0, 10000000.0,
       145000000.0, 100000000.0, 21000000.0, 4000000.0, 20000000.0,
       560000.0, 275000.0, 4500000.0, 15000000.0, 390000000.0, 7000000.0,
       5100000.0, 700000000.0, 2300000.0, 700000.0, 19000000.0, 9000000.0,
       40000000.0, 750000.0, 1500000.0, 7800000.0, 50000000.0, 80000000.0,
       30000000.0, 1700000.0, 2500000.0, 40000.0, 33000000.0, 35000000.0,
       300000.0, 25000000.0, 3500000.0, 200000000.0, 6000000.0, 1300000.0,
       4100000.0, 575000.0, 800000.0, 28000000.0, 18000000.0, 3200000.0,
       900000.0, 250000.0, 4700000.0, 75000000.0, 8000000.0, 121000000.0,
       55000000.0, 3300000.0, 11000000.0, 16000000.0, 5400000.0,
       150000000.0, 4200000.0, 22000000.0, 52000000.0, 1100000.0,
       118000000.0, 1600000.0, 18500000.0, 70000000000.0, 800000000.0,
       400000000.0, 150000.0, 176000000.0, 60000000.0, 470000.0, 240000.0,
       3000000000.0, 74000000.0, 62000000.0, 2100000.0, 500000000.0,
       12500000.0, 2200000000.0, 5060000.0, 225000000.0, 24700000.0,
       7700000.0, 19067328.0, 51000000.0, 115000.0, 54000.0, 20000.0,
       803146.0, 238000.0, 10220000.0, 1020000.0, 12000000.0, 13400000.0,
       170000000.0, 2900000.0, 543000.0, 90000000.0, 3400000.0,
       23000000.0, 8090000.0, 1030000.0, 5040000.0, 360000.0, 1400000.0,
       650000.0, 54000000.0, 42500000.0, 11370000.0, 325000.0, 410000.0,
       450000.0, 682000.0, 4050000.0, 1050000.0, 1080000.0, 4300000.0,
       6800000.0, 2110000.0, 764000.0, 603000.0, 409000.0, 292000.0,
       286000.0, 136000.0, 546000.0, 887000.0, 43000.0, 40900.0,
       2200000.0, 5660000.0, 350000.0, 110000.0, 122000000.0, 11635000.0,
       2800000.0, 1065000.0, 669000.0, 16076000.0, 649600.0, 6700000.0,
       220000.0, 266500.0, 2879000.0, 26500000.0, 351000.0, 46761000.0,
       175000.0, 11241000.0, 804000.0, 1340000.0, 467000.0, 133000.0,
       3823000.0, 934000.0, 293000.0, 198000.0, 927000.0, 971000.0,
       3060000.0, 1862000.0, 232000.0, 2888000.0, 1328000.0, 15500000.0,
       56000000.0, 2250000.0, 16753000.0, 3700000.0, 1470000.0, 530000.0,
       267000.0, 3344000.0, 7200000.0, 2743000.0, 6082000.0, 6609000.0,
       27700000.0, 5940000.0, 3964000.0, 5500000.0, 197000.0, 4327000.0,
       459000.0, 3937000.0, 1313500.0, 229800.0, 5305000.0, 264000.0,
       1750000.0, 5967000.0, 2980000.0, 323000.0, 1326000.0, 27000000.0,
       5200000.0, 2530000.0, 792000.0, 11363000.0, 1715000.0, 329000.0,
       5271000.0, 8700000.0, 3226000.0, 5900000.0, 44000000.0, 3879000.0,
       13000000.0, 8800000.0, 9500000.0, 920000.0, 35600000.0, 9400000.0,
       790000.0, 480000.0, 160000.0, 8200000.0, 4257000.0, 1410000.0,
       349800.0, 786000.0, 2004000.0, 123000000.0, 248000.0, 24000000.0,
       14259000.0, 24500000.0, 3800000.0, 18370000.0, 68525000.0,
       4800000.0, 1834000.0, 23850000.0, 43000000.0, 21600000.0,
       4598000.0, 13137000.0, 115000000.0, 3900000.0, 670000.0, 8500000.0,
       3148000.0, 2600000.0, 4049500.0, 10500000.0, 6500000.0, 43700000.0,
       13800000.0, 306900.0, 420000.0, 627300.0, 113000000.0, 32000000.0,
       110000000.0, 1397000.0, 448500.0, 7975700.0, 330000.0, 5600000.0,
       1402000.0, 21500000.0, 296000000.0, 4900000.0, 1402400.0,
       12618300.0, 9900000.0, 982530.0, 70185200.0, 210000000.0,
       84000000.0, 39000000.0, 2700000.0, 1403400.0, 105000000.0,
       103000000.0, 281300.0, 12700.0, 25000.0, 97500000.0, 507000.0,
       8400000.0, 18300000.0, 125000000.0, 181000.0, 280000.0, 14700000.0,
       13200000.0, 8043000.0, '$1,200,000', '$51,000,000', '$188,000,000',
       '$700,000', '$9,000,000', '$49,000,000', '$300,000',
       '$160,000,000', '$1,800,000', '$850,000', '$53,000,000',
       '$500,000', '$21,000,000', '$7,500,000', '$7,400,000',
       '$800,000,000', '$17,000,000', '$3,500,000', '$215,000,000',
       '$350,000,000', '$83,000,000', '$110,000,000', '$500,000,000',
       '$65,000,000', '$150,000,000,000', '$300,000,000', '$2,200,000',
       '$140,000,000', '$13,000,000', None, '$Undisclosed', '$2000000',
       '$800000', '$6000000', '$2500000', '$9500000', '$13000000',
       '$5000000', '$8000000', '$1000000', 'Upsparks', '$200000',
       '$12000000', '$1500000', '$1700000', '$5500000', '$400000',
       '$150000000', '$4000000', '$100000000', '$500000', '$15000000',
       '$10000000', '$40000000', '$225000000', '$6700000', '$1300000',
       '$20000000', '$250000', '$21000000', '$1200000', '$52000000',
       '$3800000', '$17500000', '$42000000', '$2300000', '$7000000',
       '$30000000', '$450000000', '$28000000', '$300000', '$3500000',
       '$8500000', '$25000000', '$3000000', '$37000000', '$370000000',
       '$700000', '$16000000', '$100000', '$44000000', '$770000',
       '$125000000', '$35000000', '$50000000', '$4900000', '$145000000',
       '$22000000', '$70000000', '$6600000', '$32000000', '$24000000',
       '$725000', '$461000', 'Series C', 'Seed', '$96000000', '$60000000',
       '$500000000', '$266000000', '$4500000', '$325000000', '$6500000',
       '$1600000', '$150000', '$225000', '$85000000', '$235000',
       '$260000', '$2900000', '$53000000', '$1100000', '$86000000',
       '$130000', '$$100,00', '$111000000', '$265000', '$76000000',
       '$75,000,000', '$3,800,000', '$1,600,000', '$260,000',
       '$18,000,000', '$350,000', '$95,000,000', '$4,100,000',
       '$5,200,000', '$1,400,000', '$2,600,000', '$16,000,000',
       '$280,000,000', '$14,300,000', '$81,000,000', '$1,300,000',
       '$8,200,000', '$720,000', '$600000', '$9000000', '$1800000',
       '$330000', '$undisclosed', '$200000000', '$36000000', '$67000000',
       '$10200000', '$220000000', '$108000000', '$75000000', '$450000',
       '$660000000', 'ah! Ventures', '$45000000', '$3200000', '$370000',
       'Pre-series A', 'ITO Angel Network, LetsVenture', '$48000000',
       '$3600000', '$11000000', '$192000000', '$65000000', '$1400000',
       '$1900000', '$41000000', '$144000000', '$5200000', '$270000000',
       '$140000', '$250000000', '$320000', '$350000000', '$4800000',
       '$38000000', '$125000', '$26000000', '$64000000', '$620000',
       '$900000', 'JITO Angel Network, LetsVenture', '$2600000',
       '$1,250,000', '$400,000,000', '$1,700,000', '$27,000,000',
       '$234,000,000', '$460,000,000', '$13,500,000', '$5,100,000',
       '$195,000,000', '$125,000', '$45,000,000', '$200,000,000',
       '$7,300,000', '$12,500,000', '$24,000,000', '$16,500,000',
       '$340,000', '$43,000,000', '$3300000', '$92000000', '$17000000',
       '$135000000', '$$1,55,000', '$2100000', '$840000000', '$248000000',
       '$4300000', '$570000', '$2200000', '$4700000', '$300000000',
       '$260000000', '$140000000', '$175000000', '$19000000', '$810000',
       '$7500000', '$600000000', '$90000000', '$5700000', '$6750000',
       '$78000000', '$5400000', '$115000000', '$255000000', '$18000000',
       '$570000000', '$550000', '$2700000', '$4200000', '$31000000',
       '$540000', '$14000000', '$340000', '$', '$6200000', '$750000',
       '$6300000', '$23000000', '$55000000'], dtype=object)